{
  "colors": [
    "0066cc",
    "cc0000",
    "009933",
    "cc6600",
    "663300",
    "990099"
  ],
  "game_phases": [
    {
      "instructions": "",
      "css_classes": "pick_scenario",
      "id": 1,
      "name": "",
      "flavors": []
    },
    {
      "instructions": "<p>To begin building your logic model, read the scenario, identify the input(s) and enter one input per box. You must enter at least one input and click \"I am done!\" to move into long-term outcomes column.</p>\r\n<p>Points to keep in mind:</p>\r\n<ul>\r\n\t<li>At any point, you may click on the question mark icon in any box to view more information about each column of the logic model.</li>\r\n\t<li>When creating logic models, it is recommended that you start at the left-most column, to define your resources, then jump to the last column, to define the ultimate outcome of your program, and then fill in the middle columns from right to left. To encourage this thinking, the system will guide you through this process. A completed logic model is read from left to right using if-then statements.</li>\r\n\t<li>You may enter up to 256 characters per box, and you may edit and delete text as needed. <b>Do not click the back button on your browser window</b> to “undo” an action, as this will clear and reset the logic model table.</li>\r\n</ul>",
      "css_classes": "add_inputs",
      "id": 2,
      "name": "Step 1: Add Inputs",
      "flavors": ["first"]
    },
    {
      "instructions": "<p>From the scenario, identify the long-term outcome(s) in the scenario and enter one outcome per box. You must enter at least one long-term outcome and click “I am done!” to move into the middle columns.</p>\r\n<p>Points to keep in mind:</p>\r\n<ul>\r\n\t<li>At any point, you may click on the question mark icon in any box to view more information about each column of the logic model.</li>\r\n\t<li>When creating logic models, it is recommended that you start at the left-most column, to define your resources, then jump to the last column, to define the ultimate outcome of your program, and then fill in the middle columns from right to left. To encourage this thinking, the system will guide you through this process. A completed logic model is read from left to right using if-then statements.</li>\r\n\t<li>You may enter up to 256 characters per box, and you may edit and delete text as needed. <b>Do not click the back button on your browser window</b> to “undo” an action, as this will clear and reset the logic model table.</li>\r\n</ul>",
      "css_classes": "add_long_term_outcomes",
      "id": 3,
      "name": "Step 2. Add Long-term Outcomes",
      "flavors": ["last"]
    },
    {
      "instructions": "<p>From the scenario, identify the intermediate outcomes, short term outcomes, outputs, and activities in the scenario.</p>\r\n<p>Enter one component per box. You must enter at least one activity, one output, one short-term outcome, and one intermediate output. Then click \"I am done!\" to open up all columns for final edits and changes.</p>\r\n<p>Points to keep in mind:</p>\r\n<ul>\r\n\t<li>At any point, you may click on the question mark icon in any box to view more information about each column of the logic model.</li>\r\n\t<li>When creating logic models, it is recommended that you start at the left-most column, to define your resources, then jump to the last column, to define the ultimate outcome of your program, and then fill in the middle columns from right to left. To encourage this thinking, the system will guide you through this process. A completed logic model is read from left to right using if-then statements.</li>\r\n\t<li>You may enter up to 256 characters per box, and you may edit and delete text as needed. <b>Do not click the back button on your browser window</b> to \"undo\" an action, as this will clear and reset the logic model table.</li>\r\n</ul>",
      "css_classes": "add_intermediate_columns",
      "id": 4,
      "name": "Step 3. Add Intermediate Outcomes, Short-term outcomes, Outputs, and Activities",
      "flavors": ["middle"]
    },
    {
      "instructions": "<p>Complete your final text and edits. You may change the colors of boxes by clicking the color wheel. Click “I am done!” to conclude this activity.</p>\r\n\r\n<p>\r\nAs you create your own logic model, use the color wheel (<img src=\"../img/assets/icon-color.png\">) on the text boxes to help you differentiate which levels you are intervening on. For example, you can use blue to designate activities, outputs, and outcomes on the individual level and green to designate activities, outputs, and outcomes on the societal level; however, you can choose whichever colors you prefer for each level.\r\n</p>",
      "css_classes": "finish_work",
      "id": 5,
      "name": "Step 4. Finalize your logic model",
      "flavors": ["first", "middle", "last"]
    },
    {
      "instructions": "<p>Congratulations on finishing your logic model! You now have a visual representation of a master plan to improve healthy access to food.</p>\r\n\r\n<p>Your work will not be saved when you leave this activity page, so, we recommend that you <b>print your logic model</b>.</p>\r\n\r\n<p>You can also compare your model to an expert logic model. To view an expert logic model, click <b>“Show expert logic model”</b> below.</p>",
      "css_classes": "conclusion",
      "id": 6,
      "name": "Step 5. Conclusion",
      "flavors": ["first", "middle", "last", "end"]
    }
  ]
}