{
  "scenarios": [
    {
      "answer_key": "expert_key_scenario01.pdf",
      "difficulty": "Easy",
      "instructions": "<p>Most neighborhoods have at least one corner store/bodega that is easily accessible to all residents but primarily stocks processed, packaged foods. By working with store owners, a variety of changes can be made to help corner stores/bodegas sell fresh produce. This serves to increase access to healthy food in existing outlets for community members who may not otherwise have had this opportunity. However, if individuals do not know that fresh produce is being offered at their local bodega or how to prepare fresh produce, the long term outcomes of decreasing prevalence of chronic disease due to food related causes may not be achieved. In constructing the logic model for changing <b>individual behavior</b> to shop for fresh produce, consider what personnel and resources will be required, activities and resulting outputs will be needed for individuals to buy and prepare fresh produce, and the outcomes of these activities.</p>",
      "id": "scenario-1",
      "title": "Assist existing corner stores/bodegas with stocking healthy foods (Individual-level behavior change)"
    },
    {
      "answer_key": "expert_key_scenario02.pdf",
      "difficulty": "Medium",
      "instructions": "<p>Many neighborhoods that lack access to healthy food may not be able to build new grocery stores to correct this.  Farmers’ markets can be an alternative way to improve availability of fresh food, and also provide a great opportunity for community education about nutrition and how to prepare healthy meals with fresh produce.  In constructing the logic model for changing the behaviors of <b>individuals and the community</b>, consider what personnel and resources will be required, what activities and resulting outputs will be needed to implement regular farmers’ markets, and the outcomes of these activities.</p>",
      "id": "scenario-2",
      "title": "Implement regular farmers’ markets (Individual- and community-level change)"
    },
    {
      "answer_key": "expert_key_scenario03.pdf",
      "difficulty": "Hard",
      "instructions": "<p>Underserved neighborhoods provide a great potential market for new grocery store locations.  Building a new grocery store in a community that lacks access to fresh food is a substantial undertaking, but can also have a large, multifaceted impact on the community’s health and local economy.  In constructing the logic model for changing the behaviors of <b>individuals, the community, and the broader societal context</b>, consider what personnel and resources will be required, what activities and resulting outputs will be needed to attract new grocery stores to build in underserved neighborhoods, and the outcomes of these activities.</p>",
      "id": "scenario-3",
      "title": "Attract new grocery stores to build in underserved neighborhoods (Individual-, community-, and society-level change)"
    },
    {
      "answer_key": "",
      "difficulty": "Medium",
      "instructions": "<p>Build a logic model using your own existing program or your ideas for a new public health program.</p>",
      "id": "scenario-4",
      "title": "Use your own"
    }
  ]
}